app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hello"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    #database query
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wAby_hRSGE35QTc6K_n4Jg"], ["updated_at", "2020-10-14 17:14:11.751403"], ["id", 4]]
---
  def reset_session_token!
    #first generate the session token
    self.session_token = User.generate_session_token
    #! = 'loud/fast error'
    self.save!